<?php

use Illuminate\Database\Seeder;
use App\Models\Service;

class ServicesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $services = [
            ['name' => 'Консультация (осмотр, совет)', 'price' => 30],
            ['name' => 'Анестезия - апликация', 'price' => 5],
            ['name' => 'Анестезия проводниковая', 'price' => 40],
            ['name' => 'Оттиск силиконовый (двойной)', 'price' => 45],
            ['name' => 'Оттиск альгинатный', 'price' => 35],
            ['name' => 'Культевая вкладка клиника, воск', 'price' => 210],
            ['name' => 'Культевая вкладка з/т лаборатория', 'price' => 350],
            ['name' => 'Культевая вкладка с запирающим штифтом', 'price' => 350],
            ['name' => 'Коронка пластмассовая (з/т лаб)', 'price' => 160],
            ['name' => 'Коронка пластмассовая временная', 'price' => 30],
            ['name' => 'Коронка штампованная (сталь)', 'price' => 200],
            ['name' => 'Литок (сталь)', 'price' => 200],
            ['name' => 'Фасетка (сталь)', 'price' => 200],
            ['name' => 'Коронка штампованная (мдзп)', 'price' => 220],
            ['name' => 'Литок (мдзп)', 'price' => 220],
            ['name' => 'Фасетк (мдзп)', 'price' => 220],
            ['name' => 'Коронка литая (сталь)', 'price' => 290],
            ['name' => 'Зуб литой сталь', 'price' => 290],
            ['name' => 'Коронка литая (мдзп)', 'price' => 320],
            ['name' => 'Зуб литой (мдзп)', 'price' => 320],
            ['name' => 'Литье в МК протезе', 'price' => 380],
            ['name' => 'Коронка МК', 'price' => 850],
            ['name' => 'Коронка МК облицовка', 'price' => 560],
            ['name' => 'Коронка МК + инд. Особенности', 'price' => 1550],
            ['name' => 'Коронка на имплантанте', 'price' => 1850],
            ['name' => 'Коронка безметалловая', 'price' => 1850],
            ['name' => 'БМК мостовидный протез до 4х ед.', 'price' => 1850],
            ['name' => 'Литой базис', 'price' => 1150],
            ['name' => 'Ч.С.П.', 'price' => 1250],
            ['name' => 'П.С.П.', 'price' => 1350],
            ['name' => 'Бюгель (кламера)', 'price' => 5100],
            ['name' => 'Бюгель (аттачмены)', 'price' => 5200],
            ['name' => 'Valplast', 'price' => 2100],
            ['name' => 'Valplast micro', 'price' => 980],
            ['name' => 'Перебазировка с/п клиника', 'price' => 300],
            ['name' => 'Перебазировка с/п лаборатория', 'price' => 390],
            ['name' => 'Индивидуальная ложка', 'price' => 70],
            ['name' => 'Починка с/п: перелом базиса', 'price' => 290],
            ['name' => 'Починка с/п: приварка зуба, кламмера', 'price' => 340],
            ['name' => 'Починка с/п: приварка последующего зуба', 'price' => 30],
            ['name' => 'Микропротез', 'price' => 450],
            ['name' => 'Сняти коронки ЦЛ,МК,МП.', 'price' => 75],
            ['name' => 'Снятие коронки штампованной', 'price' => 35],
            ['name' => 'Абатмен', 'price' => 30],
            ['name' => 'Цементировка  коронки', 'price' => 50],
            ['name' => 'Цементировка   КВ', 'price' => 50],
            ['name' => 'Коронка литая с облицовкой пластмасса', 'price' => 560],
            ['name' => 'AU', 'price' => 420],
            ['name' => 'Бюгель (пластмасса,кламмера)', 'price' => 5100],
            ['name' => 'Бюгель (пластмасса,аттачмены)', 'price' => 4500],
            ['name' => 'Импортный гарнитур', 'price' => 200],
            ['name' => 'Армировка пластинчатого Съёмного', 'price' => 420],
            ['name' => 'Извлечение КВ, анкерного штифта', 'price' => 75],
            ['name' => 'Удаление  (простое) зуба с анестезией', 'price' => 150],
            ['name' => 'КВ под готовую коронку', 'price' => 250],
        ];

        foreach ($services as $key => $value) {
            Service::updateOrCreate(
                ['name' => $value['name']],
                ['price' => $value['price']]
            );
        }
    }
}
